IDS_DPLUS_REINF_TEST_MSG                      = "Test ( DPLUS_REINF )"

IDS_FRP_MATL_GRID_STRENGTH                    = "Strength"
IDS_FRP_MATL_GRID_ELASTIC_MODULUS             = "Elastic Modulus"
IDS_FRP_MATL_GRID_STRAIN                      = "Strain"
IDS_FRP_MATL_GRID_THICKNESS                   = "Thickness"
IDS_FRP_MATL_GRID_FIBER_TYPE                  = "Fiber Type"

IDS_FRM_TBL_REIN_TYPE                         = "Reinforce\nType"

IDS_RFM_TBL_REIN_MATL                         = "Material of Reinforcement"
IDS_RFM_TBL_REIN_MATL_NAME                    = "Material\nName"
IDS_RFM_TBL_USER_MATL                         = "User Defined Material"
IDS_RFM_TBL_USER                              = "User"
IDS_RFM_TBL_USER_MATL_YIELD_STRENGTH          = "Yield\nStrength"
IDS_RFM_TBL_USER_MATL_YIELD_STRAIN            = "Yield\nStrain"
IDS_RFM_TBL_USER_MATL_THICKNESS               = "Thickness"
IDS_RFM_TBL_USER_MATL_FIBER_TYPE              = "Fiber\nType"

IDS_RFM_TBL_YIELD_RATIO                       = "Yield Ratio"
IDS_RFM_TBL_YIELD_STRENGTH                    = "Yield\nStrength"
IDS_RFM_TBL_YIELD_STRAIN                      = "Yield\nStrain"

IDS_RFM_TBL_REINFORCE_DETAIL                  = "Reinforce Detail"
IDS_RFM_TBL_REINFORCE_INFO_DOT                = "Reinforce\nInfo."
IDS_RFM_TBL_EXPOSURE_CONDITION                = "Exposure\nCondition"
IDS_RFM_TBL_WRAPING_SCHEME                    = "Wraping\nScheme"
IDS_RFM_TBL_SHEAR_DETAIL                      = "Shear Detail"
IDS_RFM_TBL_AXIAL_MOMENT_DETAIL               = "Axial +\nMoment\nDetail"
IDS_RFM_TBL_CHECK_SHEAR                       = "Check\nShear"
IDS_RFM_TBL_PIECES                            = "Piece(s)"

IDS_RFM_BATCH_DESIGN_BEAM__d__d               = "Designing Reinforce Beam. (%d/%d)"

IDS_RFM_TBL_POSITIVE_MOMENT_BEFORE            = "Positive Moment ( Before )"
IDS_RFM_TBL_NEGATIVE_MOMENT_BEFORE            = "Negative Moment ( Before )"
IDS_RFM_TBL_SHEAR_FORCE_BEFORE                = "Shear Force ( Before )"
IDS_RFM_TBL_SKIN_BAR                          = "Skin Rebar"
IDS_RFM_TBL_STRENGTHENING_LIMIT               = "Strengthening Limit Criteria"
IDS_RFM_TBL_LIMIT                             = "Limit"
IDS_RFM_TBL_POSITIVE_MOMENT_AFTER             = "Positive Moment ( After )"
IDS_RFM_TBL_NEGATIVE_MOMENT_AFTER             = "Negative Moment ( After )"
IDS_RFM_TBL_SHEAR_FORCE_AFTER                 = "Shear Force ( After )"
IDS_RFM_TBL_STRAIN                            = "Strain"
IDS_RFM_TBL_STRENGTH                          = "Strength"
IDS_RFM_TBL_STRENGTH_RATIO                    = "Strength Ratio"
IDS_RFM_TBL_MAX_STRENGTH                      = "Max. Strength"
IDS_RFM_TBL_REBAR_RATIO_MIN                   = "Rebar Ratio ( Min )"
IDS_RFM_TBL_REBAR_RATIO_MAX                   = "Rebar Ratio ( Max )"
IDS_RFM_TBL_REBAR_SPACE                       = "Rebar Space"
IDS_RFM_TBL_STRESS                            = "Stress"
IDS_RFM_TBL_CREEP                             = "Creep"
IDS_RFM_TBL_DEVELOPMENT_LENGTH                = "Development Length"

IDS_RFM_TBL_CHECK_RESULT_BEFORE               = "Check Result ( Before )"
IDS_RFM_TBL_CHECK_RESULT_AFTER                = "Check Result ( After )"
IDS_RFM_TBL_POSITIVE_MOMENT                   = "Positive Moment"
IDS_RFM_TBL_NEGATIVE_MOMENT                   = "Negative Moment"
IDS_RFM_TBL_SHEAR_FORCE                       = "Shear Force"
IDS_RFM_TBL_MIN_DOT_N_REBAR_RATIO             = "Min.\nRatio"
IDS_RFM_TBL_MAX_DOT_N_REBAR_RATIO             = "Max.\nRatio"
IDS_RFM_TBL_MAX_DOT_N_STRENGTH                = "Max.\nStrength"
IDS_RFM_TBL_REBAR_N_SPACE                     = "Rebar\nSpace"
IDS_RFM_TBL_SKIN_N_REBAR                      = "Skin\nRebar"
IDS_RFM_TBL_SHEAR_N_STRENGTH                  = "Shear\nStrength"

IDS_RFM_TBL_CORNER_RADIUS                     = "Corner"
IDS_RFM_TBL_DESIGN_RESULT_BEFORE              = "Design Result ( Before )"
IDS_RFM_TBL_DESIGN_RESULT_AFTER               = "Design Result ( After )"
IDS_RFM_TBL_FRP_CARBON_PROP                   = "FRP / Carbon Property"
IDS_RFM_TBL_GEOMETRY_OF_COLUMN                = "Geometry of Column"
IDS_RFM_TBL_CONFINED_CONCRETE                 = "Confined Concrete"

IDS_RFM_TBL_BEFORE_MOMENT_CAPA_BIG            = "MOMENT CAPACITY ( BEFORE )"
IDS_RFM_TBL_BEFORE_SHEAR_CAPA_BIG             = "SHEAR CAPACITY ( BEFORE )"
IDS_RFM_TBL_BEFORE_SEISMIC_DESIGN_BIG         = "SEISMIC DESIGN ( BEFORE )"
IDS_RFM_TBL_AFTER_MOMENT_CAPA_BIG             = "MOMENT CAPACITY ( AFTER )"
IDS_RFM_TBL_AFTER_SHEAR_CAPA_BIG              = "SHEAR CAPACITY ( AFTER )"
IDS_RFM_TBL_FRP_CARBON_PROP_BIG               = "FRP / CARBON PROPERTY"
IDS_RFM_TBL_DEVELOP_LENGTH_BIG                = "DEVELOPMENT LENGTH"
